# Brewfile
# Author: oneofthree
# Date: 2024-10-01

# Taps
#tap "homebrew/cask", args: ["--force"]

# Formulae (Command-line tools)
brew "kdoctor"
brew "openjdk" # This installs Java
brew "cocoapods"
brew "esptool"
brew "wget"
brew "jq"
brew "dockutil"

# Casks (GUI applications)
cask "vlc"
cask "firefox"
cask "iterm2"
cask "geany"
cask "arduino"
cask "freecad"
cask "visual-studio-code"
cask "vscodium"
cask "webstorm"
cask "blender"
cask "gimp"
cask "inkscape"
cask "upscayl"
cask "openshot-video-editor"
cask "audacity"
cask "libreoffice"
cask "android-studio"
cask "stellarium"
cask "transmission"
cask "orcaslicer"

# Optional: Mac App Store applications via mas
# Uncomment the following lines if you want to include them
# brew "mas"
# mas "Xcode", id: 497799835

